{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "insider_trading_op",
    "1": "insider_trading_edu",
    "2": "market_manipulation_op",
    "3": "market_manipulation_edu",
    "4": "money_laundering_op",
    "5": "money_laundering_edu",
    "6": "guaranteed_returns_op",
    "7": "guaranteed_returns_edu",
    "8": "reckless_advice_op",
    "9": "reckless_advice_edu",
    "10": "sanctions_evasion_op",
    "11": "sanctions_evasion_edu",
    "12": "general"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "general": 12,
    "guaranteed_returns_edu": 7,
    "guaranteed_returns_op": 6,
    "insider_trading_edu": 1,
    "insider_trading_op": 0,
    "market_manipulation_edu": 3,
    "market_manipulation_op": 2,
    "money_laundering_edu": 5,
    "money_laundering_op": 4,
    "reckless_advice_edu": 9,
    "reckless_advice_op": 8,
    "sanctions_evasion_edu": 11,
    "sanctions_evasion_op": 10
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 4,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
